{
  "res://Scenes/map2.tscn": [
	"Gunakan print() untuk menampilkan teks ke layar.",
	"input() selalu mengembalikan string, ubah ke int() jika perlu angka.",
	"Komentar satu baris di Python selalu diawali dengan #.",
	"Python tidak butuh deklarasi tipe variabel.",
	"Tanda = digunakan untuk memberi nilai, bukan membandingkan.",
	"Tanda == digunakan untuk melakukan perbandingan.",
	"Python menghitung dulu sebelum menampilkan hasil.",
	"int digunakan untuk angka bulat tanpa koma.",
	"str digunakan untuk data teks.",
	"True dan False adalah tipe Boolean, bukan String.",
	"Gunakan type() untuk mengecek tipe data.",
	"Operator + berarti penjumlahan untuk angka.",
	"Operator + bisa digunakan untuk penggabungan untuk string.",
	"Spasi dan indentasi sangat penting di Python.",
	"Gunakan if untuk membuat percabangan kondisi.",
	"else akan dijalankan jika kondisi if bernilai False.",
	"elif digunakan untuk menambah kondisi setelah if.",
	"Urutan if → elif → else tidak boleh dibalik.",
	"Gunakan == untuk membandingkan nilai, bukan =.",
	"Simbol > berarti lebih besar dari.",
	"Python tidak memiliki switch function, gunakan if dan elif.",
	"Setiap if harus diakhiri dengan tanda titik dua (:).",
	"Indentasi menentukan blok kode di Python.",
	"Tanpa indentasi yang benar, kode akan error.",
	"for adalah keyword utama perulangan di Python.",
	"range(n) pada for selalu dimulai dari 0.",
	"range(1) pada for hanya dijalankan satu kali dengan nilai 0.",
	"else pada if hanya jalan jika kondisi bernilai False.",
	"Indentasi yang konsisten lebih penting dari spasi banyak.",
    "Blok kode di Python tidak menggunakan {}."
  ],
  "res://Scenes/map4.tscn": [
	"Teks yang diberi tanda petik akan dianggap sebagai string.",
	"Elemen list bisa diakses dari depan maupun dari belakang.",
	"List memiliki method khusus untuk menambah data ke bagian akhir.",
	"Operator tertentu digunakan untuk mendapatkan sisa hasil bagi.",
	"Python menyediakan fungsi bawaan untuk menghitung panjang data.",
	"Operator logika AND membutuhkan semua kondisi bernilai benar.",
	"Komentar satu baris di Python menggunakan simbol khusus.",
	"Data dari input pengguna selalu diterima dalam bentuk teks.",
	"Dictionary digunakan untuk menyimpan pasangan kunci dan nilai.",
	"Dictionary didefinisikan menggunakan tanda {}.",
	"Operator penugasan gabungan dapat mengubah nilai variabel secara langsung.",
	"Tidak semua tipe data dari bahasa lain tersedia di Python.",
	"String dapat dikalikan untuk menghasilkan pengulangan teks.",
	"Potongan string di Python bisa diambil menggunakan rentang indeks.",
	"Index pada string dan list selalu dimulai dari nol.",
	"List memiliki method untuk mengambil sekaligus menghapus elemen tertentu.",
	"Fungsi range dapat menghasilkan urutan angka dengan batas awal dan akhir.",
	"Batas akhir pada range tidak ikut dihitung.",
	"Python memiliki operator khusus untuk perhitungan pangkat.",
	"Pembagian tertentu di Python menghasilkan bilangan bulat tanpa koma.",
	"String memiliki method bawaan untuk mengubah huruf menjadi kapital.",
	"Struktur data kosong biasanya dianggap bernilai salah dalam konteks logika.",
	"Python menyediakan cara sederhana untuk mengecek keberadaan data dalam list.",
	"Perkalian antara angka dan teks menghasilkan pengulangan karakter.",
	"List dapat diurutkan langsung tanpa membuat salinan baru.",
	"Beberapa tipe data berbeda di Python bisa dianggap setara saat dijadikan kunci dictionary.",
	"Dictionary tidak menyimpan dua kunci yang dianggap sama oleh Python.",
	"List comprehension dapat memiliki lebih dari satu perulangan di dalamnya.",
	"Urutan perulangan pada list comprehension memengaruhi hasil akhirnya.",
	"Python membedakan antara pengecekan nilai dan pengecekan identitas objek.",
	"Dua variabel bisa menunjuk ke objek yang sama di memori.",
	"Perubahan pada objek mutable akan terlihat oleh semua referensinya.",
	"Fungsi Python dapat menerima argumen dalam jumlah fleksibel.",
	"Argumen bertipe kamus dalam fungsi memiliki penulisan khusus.",
	"Python menyediakan fungsi untuk memasangkan elemen dari beberapa iterable.",
	"Struktur try-except memiliki bagian yang selalu dijalankan tanpa syarat.",
    "String di Python mendukung teknik pembalikan dengan langkah negatif."
  ],
  "default": [
	"index awal array selalu 0 !",
	"Kalau capek ngoding istirahat main Fesnuk !!",
	"Belajar coding itu menyenangkan bukan, BUKAN !!!",
	"Debugger memberikan informasi krusial saat terjadi kesalahan pada kode.",
	"Penulisan komentar membantu menjelaskan alur logika yang kompleks.",
	"Dokumentasi kode sangat penting untuk pemeliharaan sistem jangka panjang.",
	"Gunakan print() untuk melacak perubahan nilai variabel secara real-time.",
	"Pastikan setiap tanda kurung buka '(' memiliki pasangan penutup ')'.",
	"Indentasi yang tepat menentukan blok eksekusi dalam bahasa Python.",
	"Gunakan tipe data yang sesuai untuk efisiensi penggunaan memori.",
	"Pengecekan tipe data variabel membantu menghindari error operasional.",
	"Lakukan pengujian unit (Unit Testing) untuk memastikan fungsi berjalan benar.",
	"Nama variabel yang deskriptif mempermudah pembacaan alur program.",
	"Hindari penggunaan variabel global secara berlebihan untuk mencegah konflik data.",
	"Selalu tutup akses file setelah selesai melakukan operasi baca atau tulis.",
    "Optimasi loop dapat meningkatkan performa eksekusi program secara signifikan."
  ]
}
